[
    {
        "id": 1,
        "titulo": "Voll-Med",
        "texto": "API RESTful desenvolvida em Java com Spring Boot, projetada para gerenciar o registro de médicos, pacientes e consultas. Este projeto pessoal foi criado para aprimorar minhas habilidades em Java e Spring Boot, oferecendo uma plataforma robusta para autenticação e autorização via JWT\n\n ## Tecnologias Usadas \n\n Java \n\n \n\nMySQL \n\n \n\n Spring Security\n\n \n\nSpring Boot \n\n \n\n JSON Web Token (para controle de acesso) \n\n \n\n ## Características \n\n \n\n A VollMed oferece uma gestão abrangente dos principais elementos do sistema de saúde. A API permite a inscrição de médicos, proporcionando um controle completo sobre todo o ciclo de vida dos profissionais de saúde. Da mesma forma, o registro de pacientes é gerenciado de forma integral, desde a criação do perfil até as atualizações necessárias. \n\n Além disso, a API cuida do registro de consultas, facilitando o gerenciamento completo das marcações e interações relacionadas. Para garantir a segurança, a aplicação utiliza autenticação e autorização baseadas em JWT, o que permite um controle eficiente do acesso à API. \n\n A documentação da API é gerada automaticamente com o uso do SpringDoc, garantindo uma descrição clara e atualizada das rotas disponíveis e facilitando a integração com outros sistemas. \n\n ## Links: \n\n [Repositório do Projeto Back-end](https://github.com/LeonardoSardagna/vollmed)"
    },
    {
        "id": 2,
        "titulo": "Movie Films",
        "texto": "Essa aplicação permite aos usuários acessar informações detalhadas sobre séries de TV. Este projeto foi criado para aplicar e consolidar meus conhecimentos em **Java, Spring Boot, React e TypeScript**. A aplicação se destaca pela integração harmoniosa de diversas tecnologias e serviços, oferecendo uma experiência de usuário rica e intuitiva. Além disso, a utilização de práticas modernas de desenvolvimento assegura a robustez, escalabilidade e eficiência do sistema. \n\n ## Tecnologias Utilizadas: \n\n **Backend:** A aplicação é construída com Java, Spring Boot e o banco de dados PostgreSQL. \n\n**Frontend:** A interface do usuário é desenvolvida com React e TypeScript, proporcionando uma experiência interativa e responsiva.\n\n ## Links: \n\n \n\n [Repositório do projeto Front-end](https://github.com/LeonardoSardagna/reactFilms) \n\n [Repositório do projeto Back-end](https://github.com/LeonardoSardagna/javaFilms) \n\n [Publicação no meu LinkedIn](https://www.linkedin.com/feed/update/urn:li:activity:7204497261597237248/)"
    },
    {
        "id": 3,
        "titulo": "Organograma",
        "texto": "O projeto Rick e Morty Organo é uma aplicação web desenvolvida em React, inspirada na série animada “Rick e Morty”. Consiste em um formulário onde os usuários podem preencher informações para serem agregadas aos times, que se inspiram nos diferentes universos e personagens da série. O site também consome a API Rick and Morty para exibir alguns dos personagens da série. \n\n ## Características \n\n Formulário de Cadastro: Os usuários podem preencher informações pessoais como nome, origem, imagem, categoria. Após preencher o formulário, os usuários são automaticamente adicionados à categoria selecionada. \n\n ## Tecnologias Utilizadas \n\n O projeto utiliza uma combinação de tecnologias modernas para proporcionar uma experiência web envolvente e funcional. React é a biblioteca JavaScript escolhida para a construção das interfaces de usuário, garantindo uma interação fluida e dinâmica. HTML5 é usado para estruturar o conteúdo web de forma semântica e organizada. Para o design e apresentação, CSS3 é empregado para criar um visual atraente e responsivo. Além disso, a API Rick e Morty é integrada para acessar e exibir informações sobre os personagens da série, adicionando um elemento autêntico e interativo ao site.\n\n ## Links: \n\n[Repositório do projeto Front-end](https://github.com/LeonardoSardagna/organograma.git) \n\n [Versel](https://organograma-sigma-one.vercel.app/)"
    },
    {
        "id": 4,
        "titulo": "Nomad Explorer",
        "texto": "Nomad Explorer é uma aplicação desenvolvida em Java e React, projetada para facilitar a gestão e organização de viagens, tanto para trabalho quanto para lazer. A aplicação oferece uma plataforma completa onde os usuários podem criar viagens, convidar participantes, organizar atividades e salvar links importantes relacionados a cada viagem. \n\n ## Caracteristicas:  \n\n Os usuários podem criar uma nova viagem especificando datas de destino, início e término, e convidar participantes, que recebem um e-mail de convite com um link de confirmação. Uma vez confirmada, a viagem pode ser gerenciada com a adição de atividades diárias, como títulos, datas e horários, e com o armazenamento de links úteis, como reservas de acomodação e locais de interesse. \n\n ## Tecnologias Usadas: \n\n Backend: Java, Spring Boot, Spring Boot Starter Mail, Banco de Dados H2 em Memória. \n\n Frontend: React, TypeScript, TailwindCSS, React Router, Axios.\n\n ## Links: \n\n[Repositório do projeto Back-end](https://github.com/LeonardoSardagna/java_nomad_explorer) \n\n [Repositório do projeto Front-end](https://github.com/LeonardoSardagna/react_nomad_explorer) \n\n [Publicação no meu LinkedIn](https://www.linkedin.com/feed/update/urn:li:activity:7224156819919667201/)"
    }
]