[
    {
        "id": 1,
        "titulo": "Portfolio",
        "texto": "Bem-vindo ao meu portfólio de projetos, um espaço onde compartilho entusiasmo e paixão pelo desenvolvimento web! Este trabalho foi cuidadosamente construído durante o curso de HTML e CSS da Alura, utilizando as tecnologias HTML, CSS e FlexBox. O foco principal foi criar uma experiência visualmente atrativa e responsiva, alinhada às mais modernas e eficientes práticas de desenvolvimento web. para aproveitar este portfólio e espero que você aproveite a jornada tanto quanto eu gostei de construí-la.  \n\n ## Tecnologia usada: \n\n  **HTML**: Utilizado para estruturar o conteúdo do site de forma semântica e acessível.  \n\n**CSS**: Responsável pelo estilo e design, garantindo uma apresentação visualmente agradável.  \n\n**FlexBox**: Implementado para criar layouts flexíveis e dinâmicos, proporcionando uma experiência de usuário mais fluida em diferentes dispositivos.\n\n \n\n ## Links: \n\n [Git-Hub](https://github.com/LeonardoSardagna/portfolio.git) \n\n [Versel](https://portfolio-five-rust-15.vercel.app/)"
    },
    {
        "id": 2,
        "titulo": "News",
        "texto": "Site de notícias desenvolvido em HTML e CSS. O projeto visa disponibilizar uma plataforma simples e elegante para apresentação de notícias de forma intuitiva e responsiva.  \n\n ## Tecnologias Utilizadas \n\n **HTML**: O conteúdo estrutural do site foi desenvolvido utilizando a linguagem de marcação HTML, garantindo uma organização lógica e semântica das informações.  \n\n**CSS**: O estilo e o design visual do site foram implementados usando folhas de estilo CSS. Técnicas modernas foram aplicadas para criar uma interface atraente e fácil de navegar. \n\n ## Links: \n\n \n\n [Git-Hub](https://github.com/LeonardoSardagna/paginaNoticia.git) \n\n [Versel](https://pagina-noticia.vercel.app/)"
    },
    {
        "id": 3,
        "titulo": "Coffe and books",
        "texto": "O principal objetivo deste site é oferecer uma experiência simplificada e eficiente aos amantes de livros. Uma das principais inovações que implementei foi a forma como os livros são gerenciados no site. Anteriormente era necessário adicionar manualmente cada livro, mas agora desenvolvi uma solução que permite a atualização automática da lista de livros através de um pedido.  \n\n ## Tecnologias Utilizadas \n\n**HTML**: Usado para estruturar o conteúdo da página.  \n\n**CSS**: Responsável pelo design e estilo da interface, proporcionando uma experiência visual agradável.  \n\n**JavaScript**: Implementado para tornar a interação do usuário mais dinâmica e gerenciar a solicitação automática de livros.  \n\n**API Swiper**: Utilizada para criar carrosséis interativos de livros, proporcionando uma experiência de navegação intuitiva. \n\n ## Links: \n\n [Git-Hub](https://github.com/LeonardoSardagna/Coffee-and-Books.git) \n\n [Versel](https://coffee-and-books.vercel.app/)"
    },
    {
        "id": 4,
        "titulo": "Pomodoro",
        "texto": "O Projeto Fokus é um sistema de cronômetro projetado para ajudar os indivíduos a se concentrarem em suas atividades diárias usando a técnica Pomodoro. Este projeto foi desenvolvido como parte de um curso de JavaScript, onde já eram fornecidos HTML e CSS, com foco principal na implementação de JavaScript.\n\n ## Temporizador Pomodoro \n\n O sistema inclui um cronômetro Pomodoro, uma técnica de gerenciamento de tempo que envolve períodos de trabalho intenso seguidos de pequenos intervalos. Isso ajuda a aumentar a produtividade e manter o foco nas tarefas.\n\n ## Controle de tempo e sons \n\n Além de monitorar o tempo das sessões Pomodoro, o sistema também pode reproduzir sons personalizados dependendo do estado do cronômetro. Isso proporciona uma experiência auditiva que complementa o gerenciamento do tempo. \n\n ## Lista de tarefas\n\n O Projeto Fokus inclui uma lista de tarefas que permite aos usuários adicionar, excluir e marcar tarefas como concluídas. Isso facilita o rastreamento das atividades planejadas. \n\n ## Links: \n\n [Git-Hub](https://github.com/LeonardoSardagna/pomodoro.git) \n\n [Versel](https://pomodoro-kappa-six.vercel.app/)"
    },
    {
        "id": 5,
        "titulo": "Organograma",
        "texto": "O projeto Rick e Morty Organo é uma aplicação web desenvolvida em React, inspirada na série animada “Rick e Morty”. Consiste em um formulário onde os usuários podem preencher informações para serem agregadas aos times, que se inspiram nos diferentes universos e personagens da série. O site também consome a API Rick and Morty para exibir alguns dos personagens da série. \n\n ## Características \n\n Formulário de Cadastro: Os usuários podem preencher informações pessoais como nome, origem, imagem, categoria. Após preencher o formulário, os usuários são automaticamente adicionados à categoria selecionada. \n\n ## Tecnologias Utilizadas \n\n **React**: biblioteca JavaScript para construção de interfaces de usuário.\n\n**HTML5**: Linguagem de marcação para estruturação de conteúdo web.\n\n**CSS3**: Linguagem de estilo para design e apresentação de sites.\n\n**API Rick e Morty**: API pública para acessar informações sobre os personagens da série.\n\n ## Links: \n\n[Git-Hub](https://github.com/LeonardoSardagna/organograma.git) \n\n [Versel](https://organograma-sigma-one.vercel.app/)"
    }
]